app/views/restaurants/show.html.erb

 <ul>
   <% @restaurant.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "restaurant_categories" ON "categories"."id" = "restaurant_categories"."category_id" WHERE "restaurant_categories"."restaurant_id" = ?  [["restaurant_id", 1]]