app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
     if @restaurant.save
---
INSERT INTO "restaurants" ("name", "street", "city", "country", "postal_code", "neighborhood_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @restaurant = Restaurant.find_by_id(params[:id])

    if @restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "restaurants" SET "neighborhood_id" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["neighborhood_id", 2], ["updated_at", "2016-06-05 00:54:57.966582"], ["id", 8]]

  def destroy
    @restaurant = Restaurant.find(params[:id])
    @restaurant.delete
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 6]]